{
  "title": "Experience",
  "amo-promo": {
    "company": "Amo Promo",
    "role": "Front-end Developer",
    "period": "01/2023 - present",
    "summary": "With the purpose of promoting unforgettable experiences, I work in the planning and development of web and mobile solutions using the most modern technologies."
  },
  "health-protection": {
    "company": "Health Protection",
    "role": "Front-end Developer",
    "period": "09/2020 - 10/2022",
    "summary": "The project was developed using Next.js with TypeScript and tools such as the Context API, Axios, Tailwind CSS, Chakra UI, ESLint, and React Query. For content management, we used Sanity CMS. My activities involved front-end development, API integration, component and page creation, maintenance and bug fixing, and also continuous deployment with Netlify and Vercel."
  },
  "toxicologia-pardini": {
    "company": "Toxicologia Pardini",
    "role": "Full-stack Developer",
    "period": "08/2018 - present",
    "summary": "Reference company in toxicology testing where I act as a full-stack developer responsible for the development and maintenance of the site. Among the main activities are: on-page SEO optimization, implementation of new features, bug fixes and integrations with internal systems, CRM and ERP."
  },
  "inter-american": {
    "company": "Inter-American Coalition",
    "role": "WordPress Developer",
    "period": "08/2021 - 09/2021",
    "summary": "Project developed with WordPress Multisite to unify the organization's websites, facilitating the maintenance and management of content. I am currently responsible for monitoring and maintaining the server, updating WordPress plugins and themes, and managing website content."
  },
  "360-comunicacao": {
    "company": "360 Comunicação Digital",
    "role": "WordPress Developer",
    "period": "05/2013 - 08/2018",
    "summary": "As a communication agency focused on positioning companies with digital marketing, I participated in the whole process, from the layout creation to the publication of the site in Wordpress. My activities involved structuring and customizing WordPress themes and plugins, performance optimization and SEO, landing page creation and API integration."
  }
}
