{
  "title": "Experience",
  "ifood": {
    "company": "iFood",
    "role": "Software Engineer",
    "period": "01/2025 - present",
    "summary": "I contribute to the maintenance and evolution of an application developed in React.js. My work is focused on guaranteeing the quality, functionality and user experience of the system."
  },
  "gobrax": {
    "company": "Gobrax",
    "role": "Front-End Developer",
    "period": "07/2024 - 12/2024",
    "summary": "I was responsible for supporting and maintaining a React.js application. My activities included fixing bugs, improving functionality and ensuring that the application worked efficiently and intuitively for users."
  },
  "toxicologia-pardini": {
    "company": "Toxicologia Pardini",
    "role": "Full Stack Developer",
    "period": "08/2018 - 12/2024",
    "summary": "I have developed and implemented projects focused on optimizing websites to improve their performance and positioning in search engines (SEO). I identified and solved problems, as well as contributing innovative solutions to improve the user experience and project results."
  },

  "amo-promo": {
    "company": "Amo Promo",
    "role": "Front-End Developer",
    "period": "01/2023 - 04/2024",
    "summary": "During my time at Amo Promo, I worked as a Front-End Developer. My responsibilities included developing and enhancing web applications using React.js and Next.js. I contributed to the creation and maintenance of reusable component libraries, which helped to improve the efficiency and consistency of our development processes. In addition, I was involved in ensuring the reliability and quality of our code by writing unit tests with Jest."
  },
  "global-empregos": {
    "company": "Global Empregos",
    "role": "Full Stack Developer",
    "period": "08/2018 - 04/2023",
    "summary": "I worked as a Full Stack Developer, playing a cross-functional role that included developing technology solutions, SEO optimization, and web server management. In this challenging position, I was responsible for creating an enhanced online experience for candidates and companies."
  },
  "health-protection": {
    "company": "Health Protection",
    "role": "Full Stack Developer",
    "period": "09/2020 - 10/2022",
    "summary": "The project was developed using Next.js with TypeScript and tools such as the Context API, Axios, Tailwind CSS, Chakra UI, ESLint, and React Query. For content management, we used Sanity CMS. My activities involved front-end development, API integration, component and page creation, maintenance and bug fixing, and also continuous deployment with Netlify and Vercel."
  },
  "360-comunicacao": {
    "company": "360 Comunicação Digital",
    "role": "Full Stack Developer",
    "period": "05/2013 - 08/2018",
    "summary": "As a communication agency focused on positioning companies with digital marketing, I participated in the whole process, from the layout creation to the publication of the site in Wordpress. My activities involved structuring and customizing WordPress themes and plugins, performance optimization and SEO, landing page creation and API integration."
  }
}
