{
  "title": "Experience",
  "gobrax": {
    "company": "Gobrax",
    "role": "Desenvolvedor Front-End",
    "period": "07/2024 - 12/2024",
    "summary": "Fui responsável por dar suporte e manter uma aplicação em React.js. Minhas atividades incluíram a correção de bugs, o aprimoramento de funcionalidades e a garantia de que a aplicação funcionasse de forma eficiente e intuitiva para os usuários."
  },
  "toxicologia-pardini": {
    "company": "Toxicologia Pardini",
    "role": "Desenvolvedor Full Stack",
    "period": "08/2018 - 12/2024",
    "summary": "Desenvolvi e implementei projetos focados na otimização de sites para melhorar o desempenho e o posicionamento em mecanismos de busca (SEO). Atuei na identificação e resolução de problemas, além de contribuir com soluções inovadoras para aprimorar a experiência do usuário e os resultados dos projetos."
  },
  "amo-promo": {
    "company": "Amo Promo",
    "role": "Desenvolvedor Front-End",
    "period": "01/2023 - 04/2024",
    "summary": "Durante meu período na Amo Promo, trabalhei como Desenvolvedor Front-End. Minhas responsabilidades incluíam desenvolver e aprimorar aplicações web utilizando React.js e Next.js. Contribuí para a criação e manutenção de bibliotecas de componentes reutilizáveis, o que ajudou a melhorar a eficiência e a consistência dos nossos processos de desenvolvimento. Além disso, participei na garantia da confiabilidade e qualidade do nosso código escrevendo testes unitários com Jest."
  },
  "global-empregos": {
    "company": "Global Empregos",
    "role": "Desenvolvedor Full Stack",
    "period": "08/2018 - 04/2023",
    "summary": "Atuei como desenvolvedor full-stack, desempenhando um papel multifuncional que incluía o desenvolvimento de soluções tecnológicas, otimização de SEO e gerenciamento de servidores web. Nessa posição desafiadora, fui responsável por criar uma experiência online aprimorada para candidatos e empresas."
  },
  "health-protection": {
    "company": "Health Protection",
    "role": "Desenvolvedor Full Stack",
    "period": "09/2020 - 10/2022",
    "summary": "Projeto desenvolvido em Next.js com TypeScript e ferramentas como Context API, Axios, Tailwind CSS, Chakra UI, ESLint e React Query. Para o gerenciamento de conteúdo utilizamos o Sanity CMS. Minhas atividades envolviam o desenvolvimento do front-end, integração com APIs, criação de componentes e páginas, manutenção e correção de bugs e implantação contínua com Netlify e Vercel."
  },
  "360-comunicacao": {
    "company": "360 Comunicação Digital",
    "role": "Desenvolvedor Full Stack",
    "period": "05/2013 - 08/2018",
    "summary": "Como uma agência de comunicação focada em posicionar empresas com o marketing digital, participava de todo o processo, desde a criação do layout até a publicação do site em Wordpress. Minhas atividades envolviam a estruturação e customização de temas e plugins para WordPress, otimização de performance e SEO, criação de landing pages e integração com APIs."
  }
}
